DataProcessors/ПомощникЗаполнения3НДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПомощникЗаполнения3НДФЛ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогКУплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвансовыеПлатежиИП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформироватьДекларацию4НДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредполагаемаяСуммаДоходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки4НДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоходыВычеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВычетыФизическихЛиц</v8:Type>
								<v8:Type>cfg:EnumRef.ИсточникиДоходовФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Информация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВычета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДокументыИнтеграцииСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДокументыИнтеграцииСБанком</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовИнтеграцииСБанком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииСБанками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыУплатыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СпособыУплатыНалогов</Name>
			<Comment>Способы уплаты налогов и взносов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БанковскийПеревод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаличнымиПоКвитанции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПомощникЗаполнения3НДФЛ/Forms/УплатаНалогаПрошлыхЛет/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МожноСоздаватьДокументыУплаты = ПравоДоступа("Изменение", Метаданные.Документы.ПлатежноеПоручение)
		И ПравоДоступа("Изменение", Метаданные.Документы.РасходныйКассовыйОрдер);
	
	Организация = Параметры.Организация;
	Период      = КонецГода(Параметры.Период);
	Правило     = Параметры.Правило;
	
	Если Не ЗначениеЗаполнено(Правило) Тогда
		ЗаполнитьПравило();
	КонецЕсли;
	
	// Проверка заполнения реквизитов организации, необходимых для уплаты.
	ТекстДействия = НСтр("ru = 'уплатить задолженность по НДФЛ'");
	СообщениеТребуютсяРеквизиты = ПроверкаРеквизитовОрганизации.СтрокаСообщенияНеЗаполненыРеквизитыДляОтчетности(
		Организация, ТекстДействия);
	РеквизитыОрганизацииЗаполнены = ПроверитьРеквизитыОрганизации(Организация, Период).РеквизитыЗаполнены;
	
	ПоказыватьКомандыОплаты = ПомощникиПоУплатеНалоговИВзносов.ПоказыватьКомандыОплаты();
	
	ЗаполнитьЗадолженность();
	НайтиИОтобразитьСвязанныеПлатежи();
	УстановитьВидимостьКнопокОплаты();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеВыписки" Тогда
		
		ОбработкаЗаписиПлатежногоДокумента();
		
	ИначеЕсли ИмяСобытия = "Запись_ПлатежныйДокумент_УплатаНалогов" Тогда
		
		ПараметрОрганизация = Неопределено;
		Налог = Неопределено;
		УказанНалог = Параметр.Свойство("Налог", Налог) И ЗначениеЗаполнено(Налог);
		УказанаОрганизация = Параметр.Свойство("Организация", ПараметрОрганизация);
		
		Если ТипЗнч(Параметр) = Тип("Структура")
			И УказанаОрганизация И ПараметрОрганизация = Организация
			И УказанНалог И ЭтоУплатаНДФЛ(Налог) Тогда
			
			ОбработкаЗаписиПлатежногоДокумента();
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_Организации" И Организация = Источник Тогда
		
		РеквизитыОрганизацииЗаполнены = ПроверитьРеквизитыОрганизации(Организация, Период).РеквизитыЗаполнены;
		УправлениеФормой(ЭтотОбъект);
		
	ИначеЕсли ИмяСобытия = "УдалитьДокументУплаты" Тогда
		
		УдалитьДокументУплаты(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РезультатПроверкиРеквизитовОрганизации = ПроверитьРеквизитыОрганизации(Организация, Период);
	Если Не РезультатПроверкиРеквизитовОрганизации.РеквизитыЗаполнены Тогда
		ТекстОписанияОбъектаПроверки = НСтр("ru = 'уплаты задолженности по НДФЛ'");
		ПроверкаРеквизитовОрганизации.СообщитьОбОшибкеЗаполненияРеквизитовДляОтчетности(
			Организация,
			РезультатПроверкиРеквизитовОрганизации.НезаполненныеРеквизиты,
			"СообщениеТребуютсяРеквизиты",
			Отказ,
			ТекстОписанияОбъектаПроверки)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачисленоНажатие(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	ИндексПериода = Число(СтрЗаменить(ИмяЭлемента, "Начислено", ""));
	СтрокаПериода = РасчетыПоНалогу.Получить(ИндексПериода);
	
	ОткрытьРасшифровкуПлатежейВБюджет(СтрокаПериода.НалоговыйПериод, "НачисленияПлатежиНДФЛ");
	
КонецПроцедуры

&НаКлиенте
Процедура УплаченоНажатие(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	ИндексПериода = Число(СтрЗаменить(ИмяЭлемента, "Уплачено", ""));
	СтрокаПериода = РасчетыПоНалогу.Получить(ИндексПериода);
	
	ОткрытьРасшифровкуПлатежейВБюджет(СтрокаПериода.НалоговыйПериод, "ПлатежиНДФЛ");
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеТребуютсяРеквизитыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Контекст = Новый Структура;
	Контекст.Вставить("Период", Период);
	Контекст.Вставить("ИмяРеглОтчета", "РегламентированныйОтчет3НДФЛ");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Организация);
	ПараметрыФормы.Вставить("Назначение", "ДляОтчетности");
	ПараметрыФормы.Вставить("Контекст", Контекст);
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлатежОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПлатежныхДокументов = ПомощникиПоУплатеНалоговИВзносовКлиент.ПараметрыОбработкиПлатежныхДокументов(
		Платежи, "Платеж", ОповещениеУдаленияПлатежногоДокумента());
	
	ПомощникиПоУплатеНалоговИВзносовКлиент.ОбработкаНавигационнойСсылкиПлатежногоДокумента(
		Элемент, НавигационнаяСсылкаФорматированнойСтроки, ПараметрыПлатежныхДокументов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОплатитьСБанковскогоСчета(Команда)
	
	Оплатить(ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.БанковскийПеревод"))
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьНаличнымиПоКвитанции(Команда)
	
	Оплатить(ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.НаличнымиПоКвитанции"))
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	// Заголовок
	ЧастиЗаголовка = Новый Массив;
	Если Форма.НДФЛДолг > 0 Тогда
		ЧастиЗаголовка.Добавить(НСтр("ru = 'Задолженность по НДФЛ'"));
	ИначеЕсли Форма.НДФЛПереплата > 0 Тогда
		ЧастиЗаголовка.Добавить(НСтр("ru = 'Переплата по НДФЛ'"));
	Иначе
		ЧастиЗаголовка.Добавить(НСтр("ru = 'Расчеты по НДФЛ'"));
	КонецЕсли;
	
	ЧастиЗаголовка.Добавить(СтрШаблон(НСтр("ru = 'до %1 года'"), Формат(Год(форма.Период) + 1, "ЧГ=0")));
	
	Форма.Заголовок = СтрСоединить(ЧастиЗаголовка, " ");
	ЕстьЗадолженность = Форма.НДФЛДолг > 0;
	
	Элементы.ДекорацияЗаголовокОстатки.Видимость = ЕстьЗадолженность;
	Элементы.ГруппаОплатаЗадолженности.Видимость = ЕстьЗадолженность;
	
	Если Форма.ПоказыватьКомандыОплаты И ЕстьЗадолженность Тогда
		Элементы.ГруппаКомандыОплаты.Видимость = Истина;
		УправлениеКомандамиОплаты(Форма);
	Иначе
		Элементы.ГруппаКомандыОплаты.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СообщениеТребуютсяРеквизиты.Видимость =
		(ЗначениеЗаполнено(Форма.Организация) И Не Форма.РеквизитыОрганизацииЗаполнены);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеКомандамиОплаты(Форма)
	
	Элементы = Форма.Элементы;
	
	ДоступностьКоманд = Форма.МожноСоздаватьДокументыУплаты И Не ЗадолженностьОплаченаПолностью(Форма);
	
	// Доступность
	Элементы.ОплатитьСБанковскогоСчета.Доступность    = ДоступностьКоманд;
	Элементы.ОплатитьНаличнымиПоКвитанции.Доступность = ДоступностьКоманд;
	
	УстановитьВидПоУмолчаниюОформлением(Форма, Элементы.ОплатитьСБанковскогоСчета,    ДоступностьКоманд);
	УстановитьВидПоУмолчаниюОформлением(Форма, Элементы.ОплатитьНаличнымиПоКвитанции, ДоступностьКоманд);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопокОплаты()
	
	СпособОплаты = ВыполнениеЗадачБухгалтера.СпособУплатыНалогаВзноса(Организация);
	
	НадоВыбратьСпособОплаты = Не ЗначениеЗаполнено(СпособОплаты);
	
	Элементы.ОплатитьСБанковскогоСчета.Видимость = НадоВыбратьСпособОплаты
		Или (СпособОплаты = Перечисления.СпособыУплатыНалогов.БанковскийПеревод);
	
	Элементы.ОплатитьНаличнымиПоКвитанции.Видимость = НадоВыбратьСпособОплаты
		Или (СпособОплаты = Перечисления.СпособыУплатыНалогов.НаличнымиПоКвитанции);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗадолженностьОплаченаПолностью(Форма)
	
	ЗадолженностьКУплате = НалогКУплате(Форма).Всего;
	
	Возврат ЗадолженностьКУплате <= 0;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидПоУмолчаниюОформлением(Форма, Элемент, ЭтоКнопкаПоУмолчанию)
	
	Элемент.Шрифт = Новый Шрифт(Элемент.Шрифт, , , ЭтоКнопкаПоУмолчанию);
	
	Если ЭтоКнопкаПоУмолчанию Тогда
		Элемент.ЦветФона = ЦветСтиля("ВыборСтандартногоПериодаФонКнопки");
	Иначе
		Элемент.ЦветФона = Новый Цвет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЦветСтиля(ИмяЦветаСтиля)
	
#Если Клиент Тогда
	Возврат ОбщегоНазначенияКлиент.ЦветСтиля(ИмяЦветаСтиля);
#Иначе
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
#КонецЕсли
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеЗадолженности

&НаСервере
Процедура ЗаполнитьЗадолженность()
	
	ГраницаОтчетностиПрошлыхПериодов = ПомощникиПоУплатеНалоговИВзносов.ГраницаОтчетностиПрошлыхПериодов(Организация);
	
	// Расчеты получим за все периоды, включая год формы.
	ТаблицаРасчетов = УчетНДФЛПредпринимателя.РасчетыПоНалогуЗаПредыдущиеПериоды(Организация, КонецГода(Период) + 1);
	РасчетыПоНалогу.Загрузить(ТаблицаРасчетов);
	
	РазместитьТаблицуЗадолженностиНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура РазместитьТаблицуЗадолженностиНаФорме()
	
	КоличествоПредопределенныхСтрок = КоличествоПредопределенныхСтрокПериодов();
	
	Для Каждого СтрокаРасчетов Из РасчетыПоНалогу Цикл
		
		ИндексПериода = РасчетыПоНалогу.Индекс(СтрокаРасчетов);
		
		// Добавим элементы новой строки для периода задолженности, если еще не отрисованы.
		Если ИндексПериода > (КоличествоПредопределенныхСтрок - 1) Тогда
			ДобавитьЭлементыСтрокиЗадолженности(ИндексПериода);
		КонецЕсли;
		
		ГруппаПериода = Элементы.ГруппаПериодыЗадолженности.ПодчиненныеЭлементы.Найти("ГруппаПериод" + ИндексПериода);
		ГруппаПериода.Видимость = Истина;
		
		// Представление периода
		Если Год(СтрокаРасчетов.НалоговыйПериод) = Год(ГраницаОтчетностиПрошлыхПериодов) Тогда
			НазваниеПериода = СтрШаблон(НСтр("ru = 'За периоды до %1 года'"), Формат(Год(СтрокаРасчетов.НалоговыйПериод) + 1, "ЧГ=0"));
		Иначе
			НазваниеПериода = СтрШаблон(НСтр("ru = 'За %1 год'"), Формат(Год(СтрокаРасчетов.НалоговыйПериод), "ЧГ=0"));
		КонецЕсли;
		Элементы["ПредставлениеПериода" + ИндексПериода].Заголовок = НазваниеПериода;
		
		// Начислено
		ДекорацияНачислено = Элементы["Начислено" + ИндексПериода];
		ДекорацияНачислено.Заголовок = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СтрокаРасчетов.Начислено, , "0,00");
		ДекорацияНачислено.Гиперссылка = Истина;
		
		// Уплачено
		ДекорацияУплачено = Элементы["Уплачено" + ИндексПериода];
		ДекорацияУплачено.Заголовок = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СтрокаРасчетов.Уплачено, , "0,00");
		ДекорацияУплачено.Гиперссылка = Истина;
		
		// Переплата
		ДекорацияПереплата = Элементы["Переплата" + ИндексПериода];
		ДекорацияПереплата.Заголовок = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СтрокаРасчетов.Переплата);
		ДекорацияПереплата.Гиперссылка = Ложь;
		
		// Задолженность
		ФорматНулевойЗадолженности = ?(СтрокаРасчетов.Переплата = 0, "0,00", "");
		
		ДекорацияЗадолженность = Элементы["Задолженность" + ИндексПериода];
		ДекорацияЗадолженность.Заголовок = ОбщегоНазначенияБПВызовСервера.ФорматСумм(
			СтрокаРасчетов.Задолженность, ,
			ФорматНулевойЗадолженности);
		ДекорацияЗадолженность.Гиперссылка = Ложь;
		ДекорацияЗадолженность.ЦветТекста  = ?(СтрокаРасчетов.Задолженность > 0, ЦветаСтиля.ЦветОтрицательногоЧисла, Новый Цвет());
		
	КонецЦикла;
	
	Для ИндексГруппы = РасчетыПоНалогу.Количество() По Элементы.ГруппаПериодыЗадолженности.ПодчиненныеЭлементы.Количество() - 1 Цикл
		Элементы["ГруппаПериод" + ИндексГруппы].Видимость = Ложь;
	КонецЦикла;
	
	// Итоги
	
	ИтоговыйОстатокРасчетов = РасчетыПоНалогу.Итог("Переплата") - РасчетыПоНалогу.Итог("Задолженность");
	
	НДФЛДолг      = ?(ИтоговыйОстатокРасчетов < 0, - ИтоговыйОстатокРасчетов, 0);
	НДФЛПереплата = ?(ИтоговыйОстатокРасчетов > 0, ИтоговыйОстатокРасчетов, 0);
	
	Элементы.ПереплатаИтог.Заголовок     = ОбщегоНазначенияБПВызовСервера.ФорматСумм(НДФЛПереплата);
	Элементы.ЗадолженностьИтог.Заголовок = ОбщегоНазначенияБПВызовСервера.ФорматСумм(НДФЛДолг);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементыСтрокиЗадолженности(ИндексПериода)
	
	ГруппаЭталон = Элементы.ГруппаПериод0;
	НоваяГруппа = Элементы.Добавить("ГруппаПериод" + ИндексПериода, Тип("ГруппаФормы"), Элементы.ГруппаПериодыЗадолженности);
	
	ЗаполнитьЗначенияСвойств(НоваяГруппа, ГруппаЭталон, , "Имя, ПодчиненныеЭлементы, ПутьКДаннымЗаголовка");
	
	Для Каждого ИсходныйЭлемент Из ГруппаЭталон.ПодчиненныеЭлементы Цикл
		
		ИмяНовогоЭлемента = СтрЗаменить(ИсходныйЭлемент.Имя, "0", Строка(ИндексПериода));
		НовыйЭлемент = Элементы.Добавить(ИмяНовогоЭлемента, ТипЗнч(ИсходныйЭлемент), НоваяГруппа);
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент, , "Имя");
		
		ДействиеЭлемента = ИсходныйЭлемент.ПолучитьДействие("Нажатие");
		Если ЗначениеЗаполнено(ДействиеЭлемента) Тогда
			НовыйЭлемент.УстановитьДействие("Нажатие", ДействиеЭлемента);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция КоличествоПредопределенныхСтрокПериодов()
	
	КоличествоСтрок = 0;
	
	Пока Истина Цикл
		Если Элементы.Найти("ГруппаПериод" + КоличествоСтрок) <> Неопределено Тогда
			КоличествоСтрок = КоличествоСтрок + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоСтрок;
	
КонецФункции

#КонецОбласти

#Область ОтображениеДокументовУплаты

&НаСервере
Процедура ОбработкаЗаписиПлатежногоДокумента()
	
	ЗаполнитьЗадолженность();
	НайтиИОтобразитьСвязанныеПлатежи();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура НайтиИОтобразитьСвязанныеПлатежи()
	
	Если НДФЛДолг <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	Платежи.Очистить();
	
	ЗаполнитьТаблицыПлатежей();
	ВывестиПлатежиИБаннерСостоянияОтправкиНаФорму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыПлатежей()
	
	ТаблицаПлатежей = УчетНДФЛПредпринимателя.УплаченныйНалогЗаПериодПоДокументам(
		Организация, НачалоГода(Период), КонецГода(Период));
	
	Если ТаблицаПлатежей <> Неопределено Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаПлатежей Цикл
			ЗаполнитьЗначенияСвойств(Платежи.Добавить(), СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПлатежиИБаннерСостоянияОтправкиНаФорму()
	
	СостоянияИнтеграцииДокументов = РегистрыСведений.ДокументыИнтеграцииСБанком.СостоянияИнтеграцииДокументов(
		ДокументыОплаты(ЭтотОбъект));
	
	ПлатежиДляОтображения = ПомощникиПоУплатеНалоговИВзносов.ПлатежиДляОтображения(
		ЭтотОбъект.Платежи, СостоянияИнтеграцииДокументов);
	ПомощникиПоУплатеНалоговИВзносов.ОтобразитьПлатежи(ЭтотОбъект, ПлатежиДляОтображения, "Платеж");
	
	ИнтеграцияСБанкамиФормы.ПолучитьДанныеИПоказатьБаннерСостоянияОтправки(ЭтотОбъект, СостоянияИнтеграцииДокументов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДокументыОплаты(Форма)
	
	ДокументыОплаты = Новый Массив;
	
	Для Каждого Платеж Из Форма.Платежи Цикл
		ДокументыОплаты.Добавить(Платеж.Ссылка);
	КонецЦикла;
	
	Возврат ДокументыОплаты;
	
КонецФункции

#КонецОбласти

#Область УдалениеДокументовОплаты

&НаКлиенте
Функция ОповещениеУдаленияПлатежногоДокумента()
	
	Возврат Новый ОписаниеОповещения("УдалитьДокументУплатыНаКлиентеЗавершение", ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура УдалитьДокументУплатыНаКлиентеЗавершение(ДокументУплатыДляУдаления, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ДокументУплатыДляУдаления) Тогда
		УдалитьДокументУплаты(ДокументУплатыДляУдаления);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументУплаты(ДокументУплатыДляУдаления)
	
	ДокументУплатыОбъект = ДокументУплатыДляУдаления.ПолучитьОбъект();
	ДокументУплатыОбъект.УстановитьПометкуУдаления(Истина);
	
	ЗаполнитьЗадолженность();
	
	НайтиИОтобразитьСвязанныеПлатежи();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеКоманд

&НаКлиенте
Процедура Оплатить(СпособОплаты)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СуммаПлатежа = СуммаКУплате(НДФЛДолг, Платежи);
	
	ОписаниеДействияПлатеж = ОписаниеДействияДляДокументаУплатыЗадолженности(
		Организация,
		СуммаПлатежа,
		СпособОплаты,
		Период);
	
	Если ОписаниеДействияПлатеж <> Неопределено Тогда
		ВыполнениеЗадачБухгалтераКлиент.ВыполнитьДействие(ОписаниеДействияПлатеж);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НалогКУплате(Форма)
	
	Результат = Новый Структура("Всего");
	Результат.Всего = СуммаКУплате(Форма.НДФЛДолг, Форма.Платежи);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СуммаКУплате(Сумма, КоллекцияПлатежей)
	
	Возврат Макс(Сумма - СуммаПодготовленныхПлатежей(КоллекцияПлатежей), 0);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СуммаПодготовленныхПлатежей(КоллекцияПлатежей)
	
	Сумма = 0;
	
	СтрокиОтбора = КоллекцияПлатежей.НайтиСтроки(Новый Структура("Оплачено", Ложь));
	Для Каждого Платеж Из СтрокиОтбора Цикл
		Сумма = Сумма + Платеж.Сумма;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОписаниеДействияДляДокументаУплатыЗадолженности(Организация, Сумма, СпособУплатыНалога, ПериодСобытия)
	
	Возврат Обработки.ПомощникЗаполнения3НДФЛ.ОписаниеДействияУплатаНалога(
		Организация,
		Сумма,
		СпособУплатыНалога,
		ПериодСобытия,
		Истина);
	
КонецФункции

#КонецОбласти

#Область ПроверкаРеквизитовДляОтчетности

&НаСервереБезКонтекста
Функция ПроверитьРеквизитыОрганизации(Организация, Период)
	
	НезаполненныеРеквизиты = Неопределено;
	
	РеквизитыОрганизацииЗаполнены = ПроверкаРеквизитовОрганизации.РеквизитыДляОтчетностиЗаполнены(
		"РегламентированныйОтчет3НДФЛ",
		Организация,
		Период,
		НезаполненныеРеквизиты);
	
	Результат = Новый Структура;
	Результат.Вставить("РеквизитыЗаполнены", РеквизитыОрганизацииЗаполнены);
	Результат.Вставить("НезаполненныеРеквизиты", НезаполненныеРеквизиты);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ЗаполнитьПравило()
	
	Порядок = Обработки.ПомощникЗаполнения3НДФЛ.ПорядокПредоставленияОтчетаУплатыНалогаЗаПериод(Организация, Период);
	ПорядокУплаты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Порядок, "Уплата");
	
	Если ПорядокУплаты <> Неопределено Тогда
		Правило = ПорядокУплаты.Правило;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасшифровкуПлатежейВБюджет(ПериодРасчета, ВидОтчета)
	
	НачалоПериода = НачалоГода(ПериодРасчета);
	КонецПериода  = КонецГода(ПериодРасчета);
	
	ПользовательскиеНастройки  = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Организация", Организация);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоПериода);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КонецПериода", КонецПериода);
	
	ПользовательскиеОтборы = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидОтчета",                  ВидОтчета);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",  ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("ВидРасшифровки",             2);
	
	ОткрытьФорму("Отчет.РасшифровкаПлатежейВБюджет.Форма.ФормаОтчета",
		ПараметрыФормы,
		ЭтотОбъект,
		Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоУплатаНДФЛ(Налог)
	
	Возврат Обработки.ПомощникЗаполнения3НДФЛ.ЭтоУплатаНДФЛ(Налог);
	
КонецФункции

#КонецОбласти
